# CannotChangeImportSymbol Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..ImportFailures..::..CannotChangeImportSymbol Property
BuiltInFailures..::..ImportFailures Class See Also
---
Can't change an imported or linked element's symbol type.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotChangeImportSymbol { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotChangeImportSymbol As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotChangeImportSymbol {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..ImportFailures Class
Autodesk.Revit.DB Namespace